lisp-executable.org
#+TITLE: Defining Command Line Programs in Common Lisp
#+AUTHOR: Mark Cox

The lisp-executable library provides a language for defining and
creating programs that can be used from the Unix shell instead of the
Lisp read-eval-print-loop (REPL).

[TABLE-OF-CONTENTS]

* Introduction
The goal of this Common Lisp library is to provide a convenient
abstraction to creating executable programs that can interact easily
with other tools that accompany the Unix shell. The abstraction should
be familiar and straight forward to use.

The library consists of
- a language for defining programs that accept command line arguments.
- the ability to automatically generate an executable for a defined
  program.
- an ASDF:COMPONENT so that executables can be built using an
  ASDF:OPERATION.

The library provides two different styles of passing command line
arguments to the defined program
- [[* Defining a program][Program]] :: A program which accepts options and arguments with
             options appearing anywhere on the command line.
- [[Dispatcher]] :: A program which dispatches to other programs. Example
                software of this style would be ~xargs~, ~git~ and
                ~svn~.

Lastly, the automatic executable creation relies heavily on ASDF. It
is assumed that all programs are declared within an ASDF system.

Automatic executable creation has been implemented for [[http://www.sbcl.org][SBCL]], [[http://ecls.sourceforge.net/][ECL]],
[[http://www.clisp.org/][CLISP]], [[http://ccl.clozure.com/][CCL]] and [[http://www.cons.org/cmucl/][CMUCL]].

* Getting Started Quickly
- Create an ASDF system to manage your program. 
  #+begin_src lisp
  ;; File lisp-executable-example.asd
  
  (eval-when (:compile-toplevel :load-toplevel :execute)
    (asdf:load-system "lisp-executable"))
  
  (defsystem lisp-executable-example
    :components ((:modules "example/"
                           :serial t
                           :components ((:file "main")
                                        (lisp-executable:executable "example-program" :program ("LISP-EXECUTABLE.EXAMPLE" "EXAMPLE-PROGRAM"))))))  
  #+end_src

- Create ~main.lisp~ and specify your program.
  #+begin_src lisp
    ;; File example/main.lisp
  (defpackage "LISP-EXECUTABLE.EXAMPLE"
    (:use "COMMON-LISP"
          "LISP-EXECUTABLE"))
  (in-package "LISP-EXECUTABLE.EXAMPLE")
  
  (define-program example-program (&options help)
    (cond
      (help
       (format t "Help has arrived."))
      (t
       (format t "You are doomed.")))
    (terpri))
  #+end_src
- Create the executable.
  #+begin_src lisp
    (asdf:oos 'lisp-executable:create-executables-op "lisp-executable-example")
  #+end_src
- Invoke from the command line.
  #+begin_example
    $ example/example-program
    You are doomed.
    $ example/example-program --help
    Help has arrived.
    $
  #+end_example
  
* Design
The API is separated in to two parts (i) the definition of the command
line arguments the program accepts (ii) the implementation on how to
associate command line arguments to the program argument symbols.

The following terms are used in this document to describe the various
components of programs that accept command line arguments:
- Command line program :: The program that is being invoked from the
     command line.
- Command line arguments :: The list of arguments being passed to the
     program.
- Program option (or option) :: A command line argument that modifies
                    how the command line program performs its
                    task. Program options can accept parameters.

* Defining a Program
The first type of command line program introduced is one where the
program options can appear at any position within the command line
arguments. For example, the following two invocations of the command
line program ~process-file~ are equivalent
#+begin_example
$ process-file input output -v
$ process-file -v input output
#+end_example

To define this type of program you use the macro
~LISP-EXECUTABLE:DEFINE-PROGRAM~.
#+begin_src lisp
(defmacro define-program (program-name program-lambda-args &body body))
#+end_src
The symbol ~PROGRAM-NAME~ is used to identify the command line
program. The format of ~PROGRAM-LAMBDA-ARGS~ is presented in the next
section. Finally, the code that uses the command line arguments is
placed in ~BODY~.
** Program Lambda Args
The type of command line arguments accepted by the program is
encapsulated within the ~PROGRAM-LAMBDA-ARGS~ form. The different
types are
- Option :: Option arguments change the behaviour of the command line
            program. 
- Argument :: An argument which is not an option.
- Others :: A collection of non option arguments.

