lisp-executable.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Defining Command Line Programs in Common Lisp</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Defining Command Line Programs in Common Lisp"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-24T13:24+1000"/>
<meta name="author" content="Mark Cox"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Defining Command Line Programs in Common Lisp</h1>

<p>The lisp-executable library provides a language for defining and
creating programs that can be used from the Unix shell instead of the
Lisp read-eval-print-loop (REPL).
</p>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Getting Started Quickly</a></li>
<li><a href="#sec-3">3 Design</a></li>
<li><a href="#sec-4">4 Defining a Program</a>
<ul>
<li><a href="#sec-4-1">4.1 Program Lambda Args</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 Options</a></li>
<li><a href="#sec-4-1-2">4.1.2 Arguments</a></li>
<li><a href="#sec-4-1-3">4.1.3 Other Arguments</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Defining a Dispatcher</a></li>
<li><a href="#sec-6">6 Testing a Program</a></li>
<li><a href="#sec-7">7 Reading the command line</a></li>
<li><a href="#sec-8">8 Generating a program</a></li>
<li><a href="#sec-9">9 ASDF Build Integration</a></li>
<li><a href="#sec-10">10 Conversion Functions</a></li>
<li><a href="#sec-11">11 Testing the library</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">

<p>The goal of this Common Lisp library is to provide a convenient
abstraction to creating executable programs that can interact easily
with other tools that accompany the Unix shell. The abstraction should
be familiar and straight forward to use.
</p>
<p>
The library consists of
</p><ul>
<li>a language for defining programs that accept command line arguments.
</li>
<li>the ability to automatically generate an executable for a defined
  program.
</li>
<li>an ASDF:COMPONENT so that executables can be built using an
  ASDF:OPERATION.
</li>
</ul>


<p>
The library provides two different styles of passing command line
arguments to the defined program
</p><dl>
<dt><a href="#Defining-a-program">Program</a></dt><dd>A program which accepts options and arguments with
             options appearing anywhere on the command line.
</dd>
<dt><a href="#Dispatcher">Dispatcher</a></dt><dd>A program which dispatches to other programs. Example
                software of this style would be <code>xargs</code>, <code>git</code> and
                <code>svn</code>.
</dd>
</dl>


<p>
Lastly, the automatic executable creation relies heavily on ASDF. It
is assumed that all programs are declared within an ASDF system.
</p>
<p>
Automatic executable creation has been implemented for <a href="http://www.sbcl.org">SBCL</a>, <a href="http://ecls.sourceforge.net/">ECL</a>,
<a href="http://www.clisp.org/">CLISP</a>, <a href="http://ccl.clozure.com/">CCL</a> and <a href="http://www.cons.org/cmucl/">CMUCL</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting Started Quickly</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Create an ASDF system to manage your program. 



<pre class="src src-lisp"><span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">File lisp-executable-example.asd</span>

(<span style="color: #728a05;">eval-when</span> (<span style="color: #728a05;">:compile-toplevel</span> <span style="color: #728a05;">:load-toplevel</span> <span style="color: #728a05;">:execute</span>)
  (asdf:load-system <span style="color: #259185;">"lisp-executable"</span>))

(defsystem lisp-executable-example
  <span style="color: #728a05;">:components</span> ((<span style="color: #728a05;">:modules</span> <span style="color: #259185;">"example/"</span>
                         <span style="color: #728a05;">:serial</span> t
                         <span style="color: #728a05;">:components</span> ((<span style="color: #728a05;">:file</span> <span style="color: #259185;">"main"</span>)
                                      (lisp-executable:executable <span style="color: #259185;">"example-program"</span> <span style="color: #728a05;">:program</span> (<span style="color: #259185;">"LISP-EXECUTABLE.EXAMPLE"</span> <span style="color: #259185;">"EXAMPLE-PROGRAM"</span>))))))  
</pre>


</li>
<li>Create <code>main.lisp</code> and specify your program.



<pre class="src src-lisp">  <span style="color: #465a61; font-style: italic;">;; </span><span style="color: #465a61; font-style: italic;">File example/main.lisp</span>
(<span style="color: #728a05;">defpackage</span> <span style="color: #259185;">"LISP-EXECUTABLE.EXAMPLE"</span>
  (<span style="color: #728a05;">:use</span> <span style="color: #259185;">"COMMON-LISP"</span>
        <span style="color: #259185;">"LISP-EXECUTABLE"</span>))
(<span style="color: #728a05;">in-package</span> <span style="color: #259185;">"LISP-EXECUTABLE.EXAMPLE"</span>)

(<span style="color: #728a05;">define-program</span> example-program (<span style="color: #a57705;">&amp;options</span> help)
  (<span style="color: #728a05;">cond</span>
    (help
     (format t <span style="color: #259185;">"Help has arrived."</span>))
    (t
     (format t <span style="color: #259185;">"You are doomed."</span>)))
  (terpri))
</pre>

</li>
<li>Create the executable.



<pre class="src src-lisp">(asdf:oos 'lisp-executable:create-executables-op <span style="color: #259185;">"lisp-executable-example"</span>)
</pre>

</li>
<li>Invoke from the command line.



<pre class="example">$ example/example-program
You are doomed.
$ example/example-program --help
Help has arrived.
$
</pre>

</li>
</ul>


<p>  
[TABLE-OF-CONTENTS]
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Design</h2>
<div class="outline-text-2" id="text-3">

<p>The API is separated in to two parts (i) the definition of the command
line arguments the program accepts (ii) the implementation on how to
associate command line arguments to the program argument symbols.
</p>
<p>
The following terms are used in this document to describe the various
components of programs that accept command line arguments:
</p><dl>
<dt>Command line program</dt><dd>The program that is being invoked from the
     command line.
</dd>
<dt>Command line arguments</dt><dd>The list of arguments being passed to the
     program.
</dd>
<dt>Program option (or option)</dt><dd>A command line argument that modifies
                    how the command line program performs its
                    task. Program options can accept parameters.
</dd>
</dl>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Defining a Program</h2>
<div class="outline-text-2" id="text-4">

<p>The first type of command line program introduced is one where the
program options can appear at any position within the command line
arguments. For example, the following two invocations of the command
line program <code>process-file</code> are equivalent
</p>


<pre class="example">$ process-file input output -v
$ process-file -v input output
</pre>


<p>
To define this type of program you use the macro
<code>LISP-EXECUTABLE:DEFINE-PROGRAM</code>.
</p>


<pre class="src src-lisp">(<span style="color: #728a05;">defmacro</span> <span style="color: #2075c7;">define-program</span> (program-name program-lambda-args <span style="color: #a57705;">&amp;body</span> body))
</pre>

<p>
The symbol <code>PROGRAM-NAME</code> is used to identify the command line
program. The format of <code>PROGRAM-LAMBDA-ARGS</code> is presented in the next
section. Finally, the code that uses the command line arguments is
placed in <code>BODY</code>.
</p>
</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Program Lambda Args</h3>
<div class="outline-text-3" id="text-4-1">

<p>The type of command line arguments accepted by the program is
encapsulated within the <code>PROGRAM-LAMBDA-ARGS</code> form. The different
types are
</p><dl>
<dt>Option</dt><dd>Option arguments change the behaviour of the command line
            program. 
</dd>
<dt>Argument</dt><dd>An argument which is not an option.
</dd>
<dt>Others</dt><dd>A collection of non option arguments.
</dd>
</dl>



</div>
