lisp-executable.org
*** Options
Within the option argument type there are three subtypes depending on
whether the declared option accepts a parameter:
- No parameter option :: On or off switch. e.g. ~--verbose~
- Non mandatory parameter option :: The option can appear with or without an
     argument. e.g. ~--debug~ and ~--debug=high~
- Mandatory parameter option :: The option must appear with an
     argument. e.g. ~--exclusion-list=file.txt~

It should be noted that the manner in which options and their
parameters are read from the command line is determined by the
~*COMMAND-LINE-ARGUMENTS-READER*~ object. 

An example of declaring the different types of options is as follows
#+begin_src lisp
(define-program program (&options help (debug-level debug-level-value 1) (file file-value)))
#+end_src
Notice that all option command line arguments declared in a
~PROGRAM-LAMBDA-ARGS~ must be proceeded with the symbol
~&OPTIONS~. The ~PROGRAM~ example can accept three options ~HELP~,
~DEBUG-LEVEL~ and ~FILE~. The value of these symbols throughout the
body of ~PROGRAM~ can be either non ~NIL~ or ~NIL~ depending on
whether the option was found on the command line.

The symbol ~HELP~ is a no parameter option. The option ~DEBUG-LEVEL~
is a non mandatory parameter option. If a parameter to ~DEBUG-LEVEL~
is found on the command line, the value of this parameter is assigned
to the symbol ~DEBUG-LEVEL-VALUE~. If no parameter is found, then
~DEBUG-LEVEL-VALUE~ is bound to ~1~. The option ~FILE~ is a mandatory
parameter option with its parameter value assigned to the symbol
~FILE-VALUE~.

**** Converting to other types
For options that are parameterized, the parameter value read from the
command line will be of type ~STRING~ by default. Automatic conversion
to other types can be specified using the ~CONVERSION-FUNCTION~
declaration expression.
#+begin_src lisp
(define-program program (&options (file file-value) (debug-level debug-level-value 1) help)
  (declare (conversion-function (integer 0 3) debug-level)))
#+end_src
User supplied conversion functions can be used by simply using the
symbol that names the function. For more information please see the
section on [[*Conversion Functions][conversion functions]].

**** Option Identifiers
In the above example, the symbol ~FILE~ will be set using the string
~--file~ on the command line if it is present.  Sometimes it is
convenient to specify other strings which are equivalent identifiers
for the same option. To accommodate this behaviour the declaration
~IDENTIFIERS~ is provided.
#+begin_src lisp
  (define-program program (&options (file file-value) (debug-level debug-level-value 1) help)
    (declare (identifiers file "file" #\f)
             (identifiers help "help" #\h)))
#+end_src
Valid identifiers are strings and characters.

Again, it is up to the ~*COMMAND-LINE-ARGUMENTS-READER*~ object to
identify options among the command line arguments.

**** Multiple encounters
The last part of option declaration is specifying what to do when the
same option is found more than once on the command line. This
behaviour can be customised using the declaration
~REDUCING-POLICY~.
#+begin_src lisp
(define-program program (&options (file file-value) (output-file output-file-value))
  (declare (reducing-policy append-policy file output-file)))
#+end_src
By default, if an option appears more than once, an error is
produced. However, a number of other policies are provided
- ~TOGGLE-POLICY~    :: Negates the previous value. Useful for no parameter options.
- ~COUNT-POLICY~     :: Count the number of times the switch appears on the command line.
- ~USE-FIRST-POLICY~ :: Use the first value read from the command line.
- ~USE-LAST-POLICY~  :: Use the last value read from the command line.
- ~APPEND-POLICY~    :: Concatenates values to form a list.
- ~ERROR-POLICY~     :: Signals an error.  

User supplied reducing functions can be used by specifying the symbol
name of the function. The function supplied must adhere to the
following policies: 
- Accept 0 arguments :: The value returned will be the value used when the argument is NOT present on the command line. (Only for no parameter option arguments)
- Accept 1 argument  :: The first time the option argument is encountered on the command line. (Not applicable for no parameter option arguments)
- Accept 2 arguments :: When the option argument is encountered again on the command line.

*** Arguments
Anything found on the command line that is not an option, is an
argument. All argument declarations occur after the ~&ARGUMENTS~
symbol.
#+begin_src lisp
(define-program program (&options help &arguments filename)
  (cond 
    (help
     (print-help))
    (filename
     (perform-action filename))
    (t
     (print-help)
     (error "Invalid usage."))))
#+end_src
The example above defines an argument ~FILENAME~. The value of
argument symbols will be either ~NIL~ or non ~NIL~ depending on
whether the argument is present on the command line or not.

By default, the value of argument symbols will be of type
string. Automatic conversion to other types can be performed using the
~CONVERSION-FUNCTION~ declaration.
#+begin_src lisp
(define-program program (&options help &arguments how-many-iterations)
  (declare (conversion-function integer how-many-iterations)))
#+end_src

*** Other Arguments
Other arguments accumulate all non processed command line arguments
passed to the program.
#+begin_src lisp
(define-program program (&options help &arguments how-many-iterations &others files))
#+end_src
String conversion for rest arguments can be specified using
the ~CONVERSION-FUNCTION~.

