lisp-executable.html

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Options</h4>
<div class="outline-text-4" id="text-4-1-1">

<p>Within the option argument type there are three subtypes depending on
whether the declared option accepts a parameter:
</p><dl>
<dt>No parameter option</dt><dd>On or off switch. e.g. <code>--verbose</code>
</dd>
<dt>Non mandatory parameter option</dt><dd>The option can appear with or without an
     argument. e.g. <code>--debug</code> and <code>--debug=high</code>
</dd>
<dt>Mandatory parameter option</dt><dd>The option must appear with an
     argument. e.g. <code>--exclusion-list=file.txt</code>
</dd>
</dl>


<p>
It should be noted that the manner in which options and their
parameters are read from the command line is determined by the
<code>*COMMAND-LINE-ARGUMENTS-READER*</code> object. 
</p>
<p>
An example of declaring the different types of options is as follows
</p>


<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> program (<span style="color: #a57705;">&amp;options</span> help (debug-level debug-level-value 1) (file file-value)))
</pre>

<p>
Notice that all option command line arguments declared in a
<code>PROGRAM-LAMBDA-ARGS</code> must be proceeded with the symbol
<code>&amp;OPTIONS</code>. The <code>PROGRAM</code> example can accept three options <code>HELP</code>,
<code>DEBUG-LEVEL</code> and <code>FILE</code>. The value of these symbols throughout the
body of <code>PROGRAM</code> can be either non <code>NIL</code> or <code>NIL</code> depending on
whether the option was found on the command line.
</p>
<p>
The symbol <code>HELP</code> is a no parameter option. The option <code>DEBUG-LEVEL</code>
is a non mandatory parameter option. If a parameter to <code>DEBUG-LEVEL</code>
is found on the command line, the value of this parameter is assigned
to the symbol <code>DEBUG-LEVEL-VALUE</code>. If no parameter is found, then
<code>DEBUG-LEVEL-VALUE</code> is bound to <code>1</code>. The option <code>FILE</code> is a mandatory
parameter option with its parameter value assigned to the symbol
<code>FILE-VALUE</code>.
</p>
<ul>
<li id="sec-4-1-1-1">Converting to other types<br/>
For options that are parameterized, the parameter value read from the
command line will be of type <code>STRING</code> by default. Automatic conversion
to other types can be specified using the <code>CONVERSION-FUNCTION</code>
declaration expression.



<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> program (<span style="color: #a57705;">&amp;options</span> (file file-value) (debug-level debug-level-value 1) help)
  (<span style="color: #728a05;">declare</span> (conversion-function (integer 0 3) debug-level)))
</pre>

<p>
User supplied conversion functions can be used by simply using the
symbol that names the function. For more information please see the
section on <a href="#sec-10">conversion functions</a>.
</p>
</li>
</ul>
<ul>
<li id="sec-4-1-1-2">Option Identifiers<br/>
In the above example, the symbol <code>FILE</code> will be set using the string
<code>--file</code> on the command line if it is present.  Sometimes it is
convenient to specify other strings which are equivalent identifiers
for the same option. To accommodate this behaviour the declaration
<code>IDENTIFIERS</code> is provided.



<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> program (<span style="color: #a57705;">&amp;options</span> (file file-value) (debug-level debug-level-value 1) help)
  (<span style="color: #728a05;">declare</span> (identifiers file <span style="color: #259185;">"file"</span> #\f)
           (identifiers help <span style="color: #259185;">"help"</span> #\h)))
</pre>

<p>
Valid identifiers are strings and characters.
</p>
<p>
Again, it is up to the <code>*COMMAND-LINE-ARGUMENTS-READER*</code> object to
identify options among the command line arguments.
</p>
</li>
</ul>
<ul>
<li id="sec-4-1-1-3">Multiple encounters<br/>
The last part of option declaration is specifying what to do when the
same option is found more than once on the command line. This
behaviour can be customised using the declaration
<code>REDUCING-POLICY</code>.



<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> program (<span style="color: #a57705;">&amp;options</span> (file file-value) (output-file output-file-value))
  (<span style="color: #728a05;">declare</span> (reducing-policy append-policy file output-file)))
</pre>

<p>
By default, if an option appears more than once, an error is
produced. However, a number of other policies are provided
</p><dl>
<dt><code>TOGGLE-POLICY</code>   </dt><dd>Negates the previous value. Useful for no parameter options.
</dd>
<dt><code>COUNT-POLICY</code>    </dt><dd>Count the number of times the switch appears on the command line.
</dd>
<dt><code>USE-FIRST-POLICY</code></dt><dd>Use the first value read from the command line.
</dd>
<dt><code>USE-LAST-POLICY</code> </dt><dd>Use the last value read from the command line.
</dd>
<dt><code>APPEND-POLICY</code>   </dt><dd>Concatenates values to form a list.
</dd>
<dt><code>ERROR-POLICY</code>    </dt><dd>Signals an error.  
</dd>
</dl>


<p>
User supplied reducing functions can be used by specifying the symbol
name of the function. The function supplied must adhere to the
following policies: 
</p><dl>
<dt>Accept 0 arguments</dt><dd>The value returned will be the value used when the argument is NOT present on the command line. (Only for no parameter option arguments)
</dd>
<dt>Accept 1 argument </dt><dd>The first time the option argument is encountered on the command line. (Not applicable for no parameter option arguments)
</dd>
<dt>Accept 2 arguments</dt><dd>When the option argument is encountered again on the command line.
</dd>
</dl>


</li>
</ul>
</div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Arguments</h4>
<div class="outline-text-4" id="text-4-1-2">

<p>Anything found on the command line that is not an option, is an
argument. All argument declarations occur after the <code>&amp;ARGUMENTS</code>
symbol.
</p>


<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> program (<span style="color: #a57705;">&amp;options</span> help <span style="color: #a57705;">&amp;arguments</span> filename)
  (<span style="color: #728a05;">cond</span> 
    (help
     (print-help))
    (filename
     (perform-action filename))
    (t
     (print-help)
     (<span style="color: #c60007; font-weight: bold;">error</span> <span style="color: #259185;">"Invalid usage."</span>))))
</pre>

<p>
The example above defines an argument <code>FILENAME</code>. The value of
argument symbols will be either <code>NIL</code> or non <code>NIL</code> depending on
whether the argument is present on the command line or not.
</p>
<p>
By default, the value of argument symbols will be of type
string. Automatic conversion to other types can be performed using the
<code>CONVERSION-FUNCTION</code> declaration.
</p>


<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> program (<span style="color: #a57705;">&amp;options</span> help <span style="color: #a57705;">&amp;arguments</span> how-many-iterations)
  (<span style="color: #728a05;">declare</span> (conversion-function integer how-many-iterations)))
</pre>


</div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> Other Arguments</h4>
<div class="outline-text-4" id="text-4-1-3">

<p>Other arguments accumulate all non processed command line arguments
passed to the program.
</p>


<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> program (<span style="color: #a57705;">&amp;options</span> help <span style="color: #a57705;">&amp;arguments</span> how-many-iterations <span style="color: #a57705;">&amp;others</span> files))
</pre>

<p>
String conversion for rest arguments can be specified using
the <code>CONVERSION-FUNCTION</code>.
</p>
</div>
</div>
</div>

</div>
