lisp-executable.org
* Defining a Dispatcher
A dispatcher program is one in which the operation to be performed is
determined from the command line. For example, the program ~git~ has a
number of commands which are all accessed via ~git~
#+begin_example
$ git init
$ git status
$ git reset
#+end_example
and so on. The goal of the dispatcher program is to easily define
these types of programs. 

The key difference between a dispatcher program and the program
defined in the previous section is in the handling of the command line
options. Any option occurring before an argument is an option to the
dispatcher and any option occurring after an argument is a option to
the dispatched program.

An example dispatcher program can be defined as follows
#+begin_src lisp
  (define-dispatcher-program git (&options help &arguments command &others others)
    (cond
      ((or help (null command))
       (print-usage))
      (command
       (alexandria:switch (command :test #'string-equal)
         ("init"
          (program-apply 'git/init others))
         ("commit"
          (program-apply 'git/commit others))
         (t
          (error "Don't know how to perform command ~A" command))))))
#+end_src

The declarations ~IDENTIFIERS~, ~CONVERSION-FUNCTION~ and
~REDUCING-POLICY~ can be used within the ~DEFINE-DISPATCHER-PROGRAM~
form as well.

* Testing a Program
A defined program can be tested by using the functions
~PROGRAM-FUNCALL~ and ~PROGRAM-APPLY~. The arguments passed to these
functions must be of type string. The identification of options and
non option arguments is handled by the object bound to
~*COMMAND-LINE-ARGUMENTS-READER*~.

#+begin_src lisp
(define-program my-program (&options help (file file-value) &arguments what-to-do)
  (list help file-value what-to-do))

(setf *command-line-arguments-reader* 'gnu-style)

(program-funcall 'my-program "hello-there")
; => (NIL NIL "hello-there")
(program-funcall 'my-program "--help")
; => (T NIL NIL)
(program-funcall 'my-program "--file=good-program")
; => (NIL "good-program" NIL)
#+end_src

The function ~PROGRAM-APPLY~ is to ~PROGRAM-FUNCALL~ as the Common
Lisp function ~APPLY~ is to ~FUNCALL~.

If you want to test the program without considering how options are
read from the command line, the functions ~PROGRAM-FUNCALL-WITH-ALIST~
and ~PROGRAM-FUNCALL-WITH-PLIST~ can be used.
#+begin_src lisp
  (program-funcall-with-alist 'my-program '((help t)))
  (program-funcall-with-plist 'my-program 'help t)
  
  (program-funcall-with-alist 'my-program '((file t) (file-value "input.txt")))
  (program-funcall-with-plist 'my-program '(file t file-value "input.txt"))
#+end_src
* Reading the command line
The object bound to the symbol ~*COMMAND-LINE-ARGUMENTS-READER*~
represents the method in which the command line arguments are
identified. As of writing, ~GNU-STYLE~ is the only implemented style
of identifying options and arguments from strings.

The GNU style uses the following templates for options
- ~-h~ :: A short option with identifier ~h~.
- ~--help~ :: A long option with identifier ~help~.
- ~--debug=1~ :: A long option with identifier ~debug~ and parameter ~1~. 
- ~--file input.txt~ :: A long option with identifier ~file~ and parameter ~input.txt~. Valid for mandatory parameter options only.
- ~-f input.txt~ :: A short option with identifier ~f~ and parameter ~input.txt~. Valid for mandatory parameter options only.
- ~--~ :: Terminate option processing. i.e. All options found after this delimiter will be treated as non option arguments.

* Generating a program
One of the features of the ~LISP-EXECUTABLE~ library is that it is
possible to generate an executable from a command line program
definition. 

The function provided to do this is ~CREATE-EXECUTABLE~.
#+begin_src lisp
  (define-program my-program (&options help)
    (cond
      (help
       (format t "Help has arrived."))
      (t
       (format t "You are doomed."))))
  
  (create-executable 'my-program "/tmp/my-program" :asdf-system "system-containing-my-program")
#+end_src

The keyword ~:asdf-system~ is important as ~CREATE-EXECUTABLE~ uses
this argument to initialize a new lisp machine in order to create the
program. The need for a separate process is that the machine specific
function equivalent to ~SAVE-LISP-MACHINE~ on some lisps actually
kills the currently executing process. e.g. ~SB-EXT:SAVE-LISP-AND-DIE~
on SBCL.
* ASDF Build Integration
The building of an executable can also be specified in the ASDF system
definition by using the ~LISP-EXECUTABLE:EXECUTABLE~ ASDF component.
#+begin_src lisp
(eval-when (:compile-toplevel :load-toplevel :execute)
  (asdf:load-system "lisp-executable"))

(defsystem lisp-executable-example
  :author "Mark Cox"
  :serial t
  :components ((:modules "example/"
			 :serial t
			 :components ((:file "main")
				      (lisp-executable:executable "example-program" :program ("LISP-EXECUTABLE.EXAMPLE" "EXAMPLE-PROGRAM"))))))
#+end_src

The keyword argument ~:PROGRAM~ contains the symbol path to the
program. From the above example, an executable will be created in the
directory "example/" with the name "example-program". When the
executable is executed, it will invoke the program
~LISP-EXECUTABLE-EXAMPLE::EXAMPLE-PROGRAM~.

To build the executable, you perform the
~LISP-EXECUTABLE:CREATE-EXECUTABLES-OP~ operation on the system. 
#+begin_src lisp
(asdf:oos 'lisp-executable:create-executables-op "lisp-executable-example")
#+end_src
