lisp-executable.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Defining a Dispatcher</h2>
<div class="outline-text-2" id="text-5">

<p>A dispatcher program is one in which the operation to be performed is
determined from the command line. For example, the program <code>git</code> has a
number of commands which are all accessed via <code>git</code>
</p>


<pre class="example">$ git init
$ git status
$ git reset
</pre>

<p>
and so on. The goal of the dispatcher program is to easily define
these types of programs. 
</p>
<p>
The key difference between a dispatcher program and the program
defined in the previous section is in the handling of the command line
options. Any option occurring before an argument is an option to the
dispatcher and any option occurring after an argument is a option to
the dispatched program.
</p>
<p>
An example dispatcher program can be defined as follows
</p>


<pre class="src src-lisp">(<span style="color: #728a05;">define-dispatcher-program</span> git (<span style="color: #a57705;">&amp;options</span> help <span style="color: #a57705;">&amp;arguments</span> command <span style="color: #a57705;">&amp;others</span> others)
  (<span style="color: #728a05;">cond</span>
    ((or help (null command))
     (print-usage))
    (command
     (alexandria:switch (command <span style="color: #728a05;">:test</span> #'string-equal)
       (<span style="color: #259185;">"init"</span>
        (program-apply 'git/init others))
       (<span style="color: #259185;">"commit"</span>
        (program-apply 'git/commit others))
       (t
        (<span style="color: #c60007; font-weight: bold;">error</span> <span style="color: #259185;">"Don't know how to perform command ~A"</span> command))))))
</pre>


<p>
The declarations <code>IDENTIFIERS</code>, <code>CONVERSION-FUNCTION</code> and
<code>REDUCING-POLICY</code> can be used within the <code>DEFINE-DISPATCHER-PROGRAM</code>
form as well.
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Testing a Program</h2>
<div class="outline-text-2" id="text-6">

<p>A defined program can be tested by using the functions
<code>PROGRAM-FUNCALL</code> and <code>PROGRAM-APPLY</code>. The arguments passed to these
functions must be of type string. The identification of options and
non option arguments is handled by the object bound to
<code>*COMMAND-LINE-ARGUMENTS-READER*</code>.
</p>



<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> my-program (<span style="color: #a57705;">&amp;options</span> help (file file-value) <span style="color: #a57705;">&amp;arguments</span> what-to-do)
  (list help file-value what-to-do))

(setf *command-line-arguments-reader* 'gnu-style)

(program-funcall 'my-program <span style="color: #259185;">"hello-there"</span>)
<span style="color: #465a61; font-style: italic;">; </span><span style="color: #465a61; font-style: italic;">=&gt; (NIL NIL "hello-there")</span>
(program-funcall 'my-program <span style="color: #259185;">"--help"</span>)
<span style="color: #465a61; font-style: italic;">; </span><span style="color: #465a61; font-style: italic;">=&gt; (T NIL NIL)</span>
(program-funcall 'my-program <span style="color: #259185;">"--file=good-program"</span>)
<span style="color: #465a61; font-style: italic;">; </span><span style="color: #465a61; font-style: italic;">=&gt; (NIL "good-program" NIL)</span>
</pre>


<p>
The function <code>PROGRAM-APPLY</code> is to <code>PROGRAM-FUNCALL</code> as the Common
Lisp function <code>APPLY</code> is to <code>FUNCALL</code>.
</p>
<p>
If you want to test the program without considering how options are
read from the command line, the functions <code>PROGRAM-FUNCALL-WITH-ALIST</code>
and <code>PROGRAM-FUNCALL-WITH-PLIST</code> can be used.
</p>


<pre class="src src-lisp">(program-funcall-with-alist 'my-program '((help t)))
(program-funcall-with-plist 'my-program 'help t)

(program-funcall-with-alist 'my-program '((file t) (file-value <span style="color: #259185;">"input.txt"</span>)))
(program-funcall-with-plist 'my-program '(file t file-value <span style="color: #259185;">"input.txt"</span>))
</pre>

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Reading the command line</h2>
<div class="outline-text-2" id="text-7">

<p>The object bound to the symbol <code>*COMMAND-LINE-ARGUMENTS-READER*</code>
represents the method in which the command line arguments are
identified. As of writing, <code>GNU-STYLE</code> is the only implemented style
of identifying options and arguments from strings.
</p>
<p>
The GNU style uses the following templates for options
</p><dl>
<dt><code>-h</code></dt><dd>A short option with identifier <code>h</code>.
</dd>
<dt><code>--help</code></dt><dd>A long option with identifier <code>help</code>.
</dd>
<dt><code>--debug=1</code></dt><dd>A long option with identifier <code>debug</code> and parameter <code>1</code>. 
</dd>
<dt><code>--file input.txt</code></dt><dd>A long option with identifier <code>file</code> and parameter <code>input.txt</code>. Valid for mandatory parameter options only.
</dd>
<dt><code>-f input.txt</code></dt><dd>A short option with identifier <code>f</code> and parameter <code>input.txt</code>. Valid for mandatory parameter options only.
</dd>
<dt><code>--</code></dt><dd>Terminate option processing. i.e. All options found after this delimiter will be treated as non option arguments.
</dd>
</dl>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Generating a program</h2>
<div class="outline-text-2" id="text-8">

<p>One of the features of the <code>LISP-EXECUTABLE</code> library is that it is
possible to generate an executable from a command line program
definition. 
</p>
<p>
The function provided to do this is <code>CREATE-EXECUTABLE</code>.
</p>


<pre class="src src-lisp">(<span style="color: #728a05;">define-program</span> my-program (<span style="color: #a57705;">&amp;options</span> help)
  (<span style="color: #728a05;">cond</span>
    (help
     (format t <span style="color: #259185;">"Help has arrived."</span>))
    (t
     (format t <span style="color: #259185;">"You are doomed."</span>))))

(create-executable 'my-program <span style="color: #259185;">"/tmp/my-program"</span> <span style="color: #728a05;">:asdf-system</span> <span style="color: #259185;">"system-containing-my-program"</span>)
</pre>


<p>
The keyword <code>:asdf-system</code> is important as <code>CREATE-EXECUTABLE</code> uses
this argument to initialize a new lisp machine in order to create the
program. The need for a separate process is that the machine specific
function equivalent to <code>SAVE-LISP-MACHINE</code> on some lisps actually
kills the currently executing process. e.g. <code>SB-EXT:SAVE-LISP-AND-DIE</code>
on SBCL.
</p></div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> ASDF Build Integration</h2>
<div class="outline-text-2" id="text-9">

<p>The building of an executable can also be specified in the ASDF system
definition by using the <code>LISP-EXECUTABLE:EXECUTABLE</code> ASDF component.
</p>


<pre class="src src-lisp">(<span style="color: #728a05;">eval-when</span> (<span style="color: #728a05;">:compile-toplevel</span> <span style="color: #728a05;">:load-toplevel</span> <span style="color: #728a05;">:execute</span>)
  (asdf:load-system <span style="color: #259185;">"lisp-executable"</span>))

(defsystem lisp-executable-example
  <span style="color: #728a05;">:author</span> <span style="color: #259185;">"Mark Cox"</span>
  <span style="color: #728a05;">:serial</span> t
  <span style="color: #728a05;">:components</span> ((<span style="color: #728a05;">:modules</span> <span style="color: #259185;">"example/"</span>
                         <span style="color: #728a05;">:serial</span> t
                         <span style="color: #728a05;">:components</span> ((<span style="color: #728a05;">:file</span> <span style="color: #259185;">"main"</span>)
                                      (lisp-executable:executable <span style="color: #259185;">"example-program"</span> <span style="color: #728a05;">:program</span> (<span style="color: #259185;">"LISP-EXECUTABLE.EXAMPLE"</span> <span style="color: #259185;">"EXAMPLE-PROGRAM"</span>))))))
</pre>


<p>
The keyword argument <code>:PROGRAM</code> contains the symbol path to the
program. From the above example, an executable will be created in the
directory "example/" with the name "example-program". When the
executable is executed, it will invoke the program
<code>LISP-EXECUTABLE-EXAMPLE::EXAMPLE-PROGRAM</code>.
</p>
<p>
To build the executable, you perform the
<code>LISP-EXECUTABLE:CREATE-EXECUTABLES-OP</code> operation on the system. 
</p>


<pre class="src src-lisp">(asdf:oos 'lisp-executable:create-executables-op <span style="color: #259185;">"lisp-executable-example"</span>)
</pre>

</div>

</div>
